# Ultralytics YOLO 🚀, GPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect
 
# Parameters
nc: 2  # number of classes
kpt_shape: [4,2]  # number of keypoints, number of dims (2 for x,y or 3 for x,y,visible)
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs
 
# YOLOv8.0n backbone
backbone:
  # MobileNetV3-large
  # [from, number, module, args]
  - [-1, 1, Conv3BN, [16, 2]]                          # 0-p1/2
  - [-1, 1, InvertedResidual, [ 16,  16, 3, 1, 0, 0]]  # 1-p1/2
  - [-1, 1, InvertedResidual, [ 24,  64, 3, 2, 0, 0]]  # 2-p2/4
  - [-1, 1, InvertedResidual, [ 24,  72, 3, 1, 0, 0]]  # 3-p2/4
  - [-1, 1, InvertedResidual, [ 40,  72, 5, 2, 1, 0]]  # 4-p3/8
  - [-1, 1, InvertedResidual, [ 40, 120, 5, 1, 1, 0]]  # 5-p3/8
  - [-1, 1, InvertedResidual, [ 40, 120, 5, 1, 1, 0]]  # 6-p3/8
  - [-1, 1, InvertedResidual, [ 80, 240, 3, 2, 0, 1]]  # 7-p4/16
  - [-1, 1, InvertedResidual, [ 80, 200, 3, 1, 0, 1]]  # 8-p4/16
  - [-1, 1, InvertedResidual, [ 80, 184, 3, 1, 0, 1]]  # 9-p4/16
  - [-1, 1, InvertedResidual, [ 80, 184, 3, 1, 0, 1]]  # 10-p4/16
  - [-1, 1, InvertedResidual, [112, 480, 3, 1, 1, 1]]  # 11-p4/16
  - [-1, 1, InvertedResidual, [112, 672, 3, 1, 1, 1]]  # 12-p4/16
  - [-1, 1, InvertedResidual, [160, 672, 5, 1, 1, 1]]  # 13-p4/16
  - [-1, 1, InvertedResidual, [160, 672, 5, 2, 1, 1]]  # 14-p5/32
  - [-1, 1, InvertedResidual, [160, 960, 5, 1, 1, 1]]  # 15-p5/32
 
# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 13], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 18
 
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 21 (P3/8-small)
 
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 18], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 24 (P4/16-medium)
 
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 27 (P5/32-large)
 
  - [[21, 24, 27], 1, Pose, [nc, kpt_shape]]  # Detect(P3, P4, P5)